# Preparação do ambiente

In [531]:
import pandas as pd

caminho_1T2023 =  r"C:\dev\processo_seletivo_intuitivecare\datasets\demonstracoes_contabeis_2023\1T2023.zip"
caminho_2T2023 = r"C:\dev\processo_seletivo_intuitivecare\datasets\demonstracoes_contabeis_2023\2T2023.zip"
caminho_3T2023 = r"C:\dev\processo_seletivo_intuitivecare\datasets\demonstracoes_contabeis_2023\3T2023.zip"
caminho_4T2023 = r"C:\dev\processo_seletivo_intuitivecare\datasets\demonstracoes_contabeis_2023\4T2023.zip"

# Exploração dos datasets

In [532]:
df_1T2023 = pd.read_csv(caminho_1T2023, sep=';')
df_2T2023 = pd.read_csv(caminho_2T2023, sep=';')
df_3T2023 = pd.read_csv(caminho_3T2023, sep=';')
df_4T2023 = pd.read_csv(caminho_4T2023, sep=';')

### df_1T2023

In [533]:
df_1T2023.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,2023-01-01,360783,12391,OUTROS CRÉDITOS DE OPERAÇÕES DE ASSISTÊNCIA MÉ...,0,0
1,2023-01-01,360783,123911,Cobertura Assistencial com Preço Preestabelecido,0,0

In [534]:
df_1T2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 729476 entries, 0 to 729475
Data columns (total 6 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   DATA               729476 non-null  object
 1   REG_ANS            729476 non-null  int64
 2   CD_CONTA_CONTABIL  729476 non-null  int64
 3   DESCRICAO          729476 non-null  object
 4   VL_SALDO_INICIAL   729476 non-null  object
 5   VL_SALDO_FINAL     729476 non-null  object
dtypes: int64(2), object(4)
memory usage: 33.4+ MB

### df_2T2023

In [535]:
df_2T2023.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,2023-04-01,354066,12811,DESPESAS ADMINISTRATIVAS,"658124,3","871046,4"
1,2023-04-01,354066,128119,Despesas Administrativas,"658124,3","871046,4"

In [536]:
df_2T2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 742059 entries, 0 to 742058
Data columns (total 6 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   DATA               742059 non-null  object
 1   REG_ANS            742059 non-null  int64
 2   CD_CONTA_CONTABIL  742059 non-null  int64
 3   DESCRICAO          742059 non-null  object
 4   VL_SALDO_INICIAL   742059 non-null  object
 5   VL_SALDO_FINAL     742059 non-null  object
dtypes: int64(2), object(4)
memory usage: 34.0+ MB

### df_3T2023

In [537]:
df_3T2023.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,2023-07-01,414492,23772,FINANCIAMENTOS,"160123,27","80061,73"
1,2023-07-01,414492,237729,Financiamentos,"160123,27","80061,73"

In [538]:
df_3T2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 764300 entries, 0 to 764299
Data columns (total 6 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   DATA               764300 non-null  object
 1   REG_ANS            764300 non-null  int64
 2   CD_CONTA_CONTABIL  764300 non-null  int64
 3   DESCRICAO          764300 non-null  object
 4   VL_SALDO_INICIAL   764300 non-null  object
 5   VL_SALDO_FINAL     764300 non-null  object
dtypes: int64(2), object(4)
memory usage: 35.0+ MB

### df_4T2023

In [539]:
df_4T2023.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,01/10/2023,422941,461719011,Alimentação ao Trabalhador,"7272,27","9882,25"
1,01/10/2023,422941,4618,DESPESAS COM TRANSPORTE DE EMPREGADOS,"4222,75","5008,33"

# Alterar o separador décimal das colunas: *VL_SALDO_INICIAL* e *VL_SALDO_FINAL*

In [540]:
df_1T2023['VL_SALDO_INICIAL'] = df_1T2023['VL_SALDO_INICIAL'].str.replace(',', '.').astype(float)
df_1T2023['VL_SALDO_FINAL'] = df_1T2023['VL_SALDO_FINAL'].str.replace(',', '.').astype(float)

In [541]:
df_2T2023['VL_SALDO_INICIAL'] = df_2T2023['VL_SALDO_INICIAL'].str.replace(',', '.').astype(float)
df_2T2023['VL_SALDO_FINAL'] = df_2T2023['VL_SALDO_FINAL'].str.replace(',', '.').astype(float)

In [542]:
df_3T2023['VL_SALDO_INICIAL'] = df_3T2023['VL_SALDO_INICIAL'].str.replace(',', '.').astype(float)
df_3T2023['VL_SALDO_FINAL'] = df_3T2023['VL_SALDO_FINAL'].str.replace(',', '.').astype(float)

In [543]:
df_4T2023['VL_SALDO_INICIAL'] = df_4T2023['VL_SALDO_INICIAL'].str.replace(',', '.').astype(float)
df_4T2023['VL_SALDO_FINAL'] = df_4T2023['VL_SALDO_FINAL'].str.replace(',', '.').astype(float)

In [544]:
df_1T2023.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,2023-01-01,360783,12391,OUTROS CRÉDITOS DE OPERAÇÕES DE ASSISTÊNCIA MÉ...,0.0,0.0
1,2023-01-01,360783,123911,Cobertura Assistencial com Preço Preestabelecido,0.0,0.0

In [545]:
df_2T2023.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,2023-04-01,354066,12811,DESPESAS ADMINISTRATIVAS,658124.3,871046.4
1,2023-04-01,354066,128119,Despesas Administrativas,658124.3,871046.4

In [546]:
df_3T2023.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,2023-07-01,414492,23772,FINANCIAMENTOS,160123.27,80061.73
1,2023-07-01,414492,237729,Financiamentos,160123.27,80061.73

In [547]:
df_4T2023.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,01/10/2023,422941,461719011,Alimentação ao Trabalhador,7272.27,9882.25
1,01/10/2023,422941,4618,DESPESAS COM TRANSPORTE DE EMPREGADOS,4222.75,5008.33

# Remover espaços em branco

In [548]:
df_1T2023['DESCRICAO'] = df_1T2023['DESCRICAO'].str.strip()
df_2T2023['DESCRICAO'] = df_2T2023['DESCRICAO'].str.strip()
df_3T2023['DESCRICAO'] = df_3T2023['DESCRICAO'].str.strip()
df_4T2023['DESCRICAO'] = df_4T2023['DESCRICAO'].str.strip()

# Concatenar os datasets

In [549]:
df_demonstracoes_contabeis_2023_v1 = pd.concat([df_1T2023, df_2T2023, df_3T2023, df_4T2023], ignore_index=True)

In [550]:
df_demonstracoes_contabeis_2023_v1

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,2023-01-01,360783,12391,OUTROS CRÉDITOS DE OPERAÇÕES DE ASSISTÊNCIA MÉ...,0.00,0.00
1,2023-01-01,360783,123911,Cobertura Assistencial com Preço Preestabelecido,0.00,0.00
2,2023-01-01,360783,12391101,Resseguros,0.00,0.00
3,2023-01-01,360783,123911011,Reembolso de Sinistros pendentes de liquidação,0.00,0.00
4,2023-01-01,360783,123911012,Reembolso de Sinistros liquidados,0.00,0.00
...,...,...,...,...,...,...
3194864,01/10/2023,373010,461619,Despesas com Formação Profissional,3186.00,3186.00
3194865,01/10/2023,373010,46161901,Despesas com Formação Profissional,3186.00,3186.00
3194866,01/10/2023,373010,461619011,Formação Profissional,3186.00,3186.00
3194867,01/10/2023,373010,4617,DESPESAS COM PROGRAMA DE ALIMENTAÇÃO AO TRABAL...,1679537.99,2058927.25
3194868,01/10/2023,373010,46171,ALIMENTAÇÃO AO TRABALHADOR,1679537.99,2058927.25

# Manipulação de datas

In [551]:
# Mudar o formato de data do quarto trimestre
mapeamento_formato_data = {
    "01/10/2023": "2023-10-01"
}

df_demonstracoes_contabeis_2023_v1['DATA'] = df_demonstracoes_contabeis_2023_v1['DATA'].replace(mapeamento_formato_data)

In [552]:
df_demonstracoes_contabeis_2023_v1

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL
0,2023-01-01,360783,12391,OUTROS CRÉDITOS DE OPERAÇÕES DE ASSISTÊNCIA MÉ...,0.00,0.00
1,2023-01-01,360783,123911,Cobertura Assistencial com Preço Preestabelecido,0.00,0.00
2,2023-01-01,360783,12391101,Resseguros,0.00,0.00
3,2023-01-01,360783,123911011,Reembolso de Sinistros pendentes de liquidação,0.00,0.00
4,2023-01-01,360783,123911012,Reembolso de Sinistros liquidados,0.00,0.00
...,...,...,...,...,...,...
3194864,2023-10-01,373010,461619,Despesas com Formação Profissional,3186.00,3186.00
3194865,2023-10-01,373010,46161901,Despesas com Formação Profissional,3186.00,3186.00
3194866,2023-10-01,373010,461619011,Formação Profissional,3186.00,3186.00
3194867,2023-10-01,373010,4617,DESPESAS COM PROGRAMA DE ALIMENTAÇÃO AO TRABAL...,1679537.99,2058927.25
3194868,2023-10-01,373010,46171,ALIMENTAÇÃO AO TRABALHADOR,1679537.99,2058927.25

# Adicionar a coluna trimestre

In [553]:
mapeamento_data_trimestre = {
    "2023-01-01": "primeiro trimestre",
    "2023-04-01": "segundo trimestre",
    "2023-07-01": "terceiro trimestre",
    "2023-10-01": "quarto trimestre"
}

df_demonstracoes_contabeis_2023_v1["TRIMESTRE"] = df_demonstracoes_contabeis_2023_v1["DATA"].map(mapeamento_data_trimestre)

In [554]:
df_filtrado_primeiro_trimestre =  df_demonstracoes_contabeis_2023_v1[df_demonstracoes_contabeis_2023_v1['DATA'] == '2023-01-01']
df_filtrado_primeiro_trimestre.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL,TRIMESTRE
0,2023-01-01,360783,12391,OUTROS CRÉDITOS DE OPERAÇÕES DE ASSISTÊNCIA MÉ...,0.0,0.0,primeiro trimestre
1,2023-01-01,360783,123911,Cobertura Assistencial com Preço Preestabelecido,0.0,0.0,primeiro trimestre

In [555]:
df_filtrado_segundo_trimestre =  df_demonstracoes_contabeis_2023_v1[df_demonstracoes_contabeis_2023_v1['DATA'] == '2023-04-01']
df_filtrado_segundo_trimestre.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL,TRIMESTRE
729476,2023-04-01,354066,12811,DESPESAS ADMINISTRATIVAS,658124.3,871046.4,segundo trimestre
729477,2023-04-01,354066,128119,Despesas Administrativas,658124.3,871046.4,segundo trimestre

In [556]:
df_filtrado_terceiro_trimestre =  df_demonstracoes_contabeis_2023_v1[df_demonstracoes_contabeis_2023_v1['DATA'] == '2023-07-01']
df_filtrado_terceiro_trimestre.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL,TRIMESTRE
1471535,2023-07-01,414492,23772,FINANCIAMENTOS,160123.27,80061.73,terceiro trimestre
1471536,2023-07-01,414492,237729,Financiamentos,160123.27,80061.73,terceiro trimestre

In [557]:
df_filtrado2 =  df_demonstracoes_contabeis_2023_v1[df_demonstracoes_contabeis_2023_v1['DATA'] == '2023-10-01']
df_filtrado2.head(2)

,DATA,REG_ANS,CD_CONTA_CONTABIL,DESCRICAO,VL_SALDO_INICIAL,VL_SALDO_FINAL,TRIMESTRE
2235835,2023-10-01,422941,461719011,Alimentação ao Trabalhador,7272.27,9882.25,quarto trimestre
2235836,2023-10-01,422941,4618,DESPESAS COM TRANSPORTE DE EMPREGADOS,4222.75,5008.33,quarto trimestre

# Salvar o csv

In [561]:
df_demonstracoes_contabeis_2023_v1.to_csv('df_demonstracoes_contabeis_2023_v1.csv', index=False, sep=";")